DELETE FROM user_roles;
DELETE FROM meals;
DELETE FROM users;

ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password) VALUES
  ('User', 'user@yandex.ru', 'password'),
  ('Admin', 'admin@gmail.com', 'admin');

INSERT INTO user_roles (role, user_id) VALUES
  ('ROLE_USER', 100000),
  ('ROLE_ADMIN', 100001);
INSERT INTO meals (datetime, description, calories, user_id)
VALUES ('2020-06-01 10:00', 'Завтрак', 500, 100000),
       ('2020-06-01 13:00', 'Обед', 1000, 100000),
       ('2020-06-01 20:00', 'Ужин', 500, 100000),
       ('2020-06-02 0:00', 'Еда на граничное значение', 100, 100000),
       ('2020-07-02 10:00', 'Завтрак', 500, 100000),
       ('2020-07-02 13:00', 'Обед', 1000, 100000),
       ('2020-07-02 20:00', 'Ужин', 500, 100000),
       ('2020-06-01 10:00', 'Завтрак Админа', 500, 100001),
       ('2020-06-01 13:00', 'Обед Админа', 1000, 100001),
       ('2020-06-01 20:00', 'Ужин Админа', 500, 100001),
       ('2020-06-02 0:00', 'Еда на граничное значение Админа', 100, 100001),
       ('2020-07-01 10:00', 'Завтрак Админа', 500, 100001),
       ('2020-07-01 13:00', 'Обед Админа', 1000, 100001),
       ('2020-07-01 20:00', 'Ужин Админа', 500, 100001);
